GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: C1RXIF
#define C1RXIF C1RXIF
C1RXIF                                   equ 0120h

// Register: C1RXIFL
#define C1RXIFL C1RXIFL
C1RXIFL                                  equ 0120h
// bitfield definitions
C1RXIFL_RFIF_POSN                        equ 0001h
C1RXIFL_RFIF_POSITION                    equ 0001h
C1RXIFL_RFIF_SIZE                        equ 0007h
C1RXIFL_RFIF_LENGTH                      equ 0007h
C1RXIFL_RFIF_MASK                        equ 00FEh
C1RXIFL_RFIF1_POSN                       equ 0001h
C1RXIFL_RFIF1_POSITION                   equ 0001h
C1RXIFL_RFIF1_SIZE                       equ 0001h
C1RXIFL_RFIF1_LENGTH                     equ 0001h
C1RXIFL_RFIF1_MASK                       equ 0002h
C1RXIFL_RFIF2_POSN                       equ 0002h
C1RXIFL_RFIF2_POSITION                   equ 0002h
C1RXIFL_RFIF2_SIZE                       equ 0001h
C1RXIFL_RFIF2_LENGTH                     equ 0001h
C1RXIFL_RFIF2_MASK                       equ 0004h
C1RXIFL_RFIF3_POSN                       equ 0003h
C1RXIFL_RFIF3_POSITION                   equ 0003h
C1RXIFL_RFIF3_SIZE                       equ 0001h
C1RXIFL_RFIF3_LENGTH                     equ 0001h
C1RXIFL_RFIF3_MASK                       equ 0008h
C1RXIFL_RFIF4_POSN                       equ 0004h
C1RXIFL_RFIF4_POSITION                   equ 0004h
C1RXIFL_RFIF4_SIZE                       equ 0001h
C1RXIFL_RFIF4_LENGTH                     equ 0001h
C1RXIFL_RFIF4_MASK                       equ 0010h
C1RXIFL_RFIF5_POSN                       equ 0005h
C1RXIFL_RFIF5_POSITION                   equ 0005h
C1RXIFL_RFIF5_SIZE                       equ 0001h
C1RXIFL_RFIF5_LENGTH                     equ 0001h
C1RXIFL_RFIF5_MASK                       equ 0020h
C1RXIFL_RFIF6_POSN                       equ 0006h
C1RXIFL_RFIF6_POSITION                   equ 0006h
C1RXIFL_RFIF6_SIZE                       equ 0001h
C1RXIFL_RFIF6_LENGTH                     equ 0001h
C1RXIFL_RFIF6_MASK                       equ 0040h
C1RXIFL_RFIF7_POSN                       equ 0007h
C1RXIFL_RFIF7_POSITION                   equ 0007h
C1RXIFL_RFIF7_SIZE                       equ 0001h
C1RXIFL_RFIF7_LENGTH                     equ 0001h
C1RXIFL_RFIF7_MASK                       equ 0080h

// Register: C1RXIFH
#define C1RXIFH C1RXIFH
C1RXIFH                                  equ 0121h
// bitfield definitions
C1RXIFH_RFIF_POSN                        equ 0000h
C1RXIFH_RFIF_POSITION                    equ 0000h
C1RXIFH_RFIF_SIZE                        equ 0008h
C1RXIFH_RFIF_LENGTH                      equ 0008h
C1RXIFH_RFIF_MASK                        equ 00FFh
C1RXIFH_RFIF8_POSN                       equ 0000h
C1RXIFH_RFIF8_POSITION                   equ 0000h
C1RXIFH_RFIF8_SIZE                       equ 0001h
C1RXIFH_RFIF8_LENGTH                     equ 0001h
C1RXIFH_RFIF8_MASK                       equ 0001h
C1RXIFH_RFIF9_POSN                       equ 0001h
C1RXIFH_RFIF9_POSITION                   equ 0001h
C1RXIFH_RFIF9_SIZE                       equ 0001h
C1RXIFH_RFIF9_LENGTH                     equ 0001h
C1RXIFH_RFIF9_MASK                       equ 0002h
C1RXIFH_RFIF10_POSN                      equ 0002h
C1RXIFH_RFIF10_POSITION                  equ 0002h
C1RXIFH_RFIF10_SIZE                      equ 0001h
C1RXIFH_RFIF10_LENGTH                    equ 0001h
C1RXIFH_RFIF10_MASK                      equ 0004h
C1RXIFH_RFIF11_POSN                      equ 0003h
C1RXIFH_RFIF11_POSITION                  equ 0003h
C1RXIFH_RFIF11_SIZE                      equ 0001h
C1RXIFH_RFIF11_LENGTH                    equ 0001h
C1RXIFH_RFIF11_MASK                      equ 0008h
C1RXIFH_RFIF12_POSN                      equ 0004h
C1RXIFH_RFIF12_POSITION                  equ 0004h
C1RXIFH_RFIF12_SIZE                      equ 0001h
C1RXIFH_RFIF12_LENGTH                    equ 0001h
C1RXIFH_RFIF12_MASK                      equ 0010h
C1RXIFH_RFIF13_POSN                      equ 0005h
C1RXIFH_RFIF13_POSITION                  equ 0005h
C1RXIFH_RFIF13_SIZE                      equ 0001h
C1RXIFH_RFIF13_LENGTH                    equ 0001h
C1RXIFH_RFIF13_MASK                      equ 0020h
C1RXIFH_RFIF14_POSN                      equ 0006h
C1RXIFH_RFIF14_POSITION                  equ 0006h
C1RXIFH_RFIF14_SIZE                      equ 0001h
C1RXIFH_RFIF14_LENGTH                    equ 0001h
C1RXIFH_RFIF14_MASK                      equ 0040h
C1RXIFH_RFIF15_POSN                      equ 0007h
C1RXIFH_RFIF15_POSITION                  equ 0007h
C1RXIFH_RFIF15_SIZE                      equ 0001h
C1RXIFH_RFIF15_LENGTH                    equ 0001h
C1RXIFH_RFIF15_MASK                      equ 0080h

// Register: C1RXIFU
#define C1RXIFU C1RXIFU
C1RXIFU                                  equ 0122h
// bitfield definitions
C1RXIFU_RFIF_POSN                        equ 0000h
C1RXIFU_RFIF_POSITION                    equ 0000h
C1RXIFU_RFIF_SIZE                        equ 0008h
C1RXIFU_RFIF_LENGTH                      equ 0008h
C1RXIFU_RFIF_MASK                        equ 00FFh
C1RXIFU_RFIF16_POSN                      equ 0000h
C1RXIFU_RFIF16_POSITION                  equ 0000h
C1RXIFU_RFIF16_SIZE                      equ 0001h
C1RXIFU_RFIF16_LENGTH                    equ 0001h
C1RXIFU_RFIF16_MASK                      equ 0001h
C1RXIFU_RFIF17_POSN                      equ 0001h
C1RXIFU_RFIF17_POSITION                  equ 0001h
C1RXIFU_RFIF17_SIZE                      equ 0001h
C1RXIFU_RFIF17_LENGTH                    equ 0001h
C1RXIFU_RFIF17_MASK                      equ 0002h
C1RXIFU_RFIF18_POSN                      equ 0002h
C1RXIFU_RFIF18_POSITION                  equ 0002h
C1RXIFU_RFIF18_SIZE                      equ 0001h
C1RXIFU_RFIF18_LENGTH                    equ 0001h
C1RXIFU_RFIF18_MASK                      equ 0004h
C1RXIFU_RFIF19_POSN                      equ 0003h
C1RXIFU_RFIF19_POSITION                  equ 0003h
C1RXIFU_RFIF19_SIZE                      equ 0001h
C1RXIFU_RFIF19_LENGTH                    equ 0001h
C1RXIFU_RFIF19_MASK                      equ 0008h
C1RXIFU_RFIF20_POSN                      equ 0004h
C1RXIFU_RFIF20_POSITION                  equ 0004h
C1RXIFU_RFIF20_SIZE                      equ 0001h
C1RXIFU_RFIF20_LENGTH                    equ 0001h
C1RXIFU_RFIF20_MASK                      equ 0010h
C1RXIFU_RFIF21_POSN                      equ 0005h
C1RXIFU_RFIF21_POSITION                  equ 0005h
C1RXIFU_RFIF21_SIZE                      equ 0001h
C1RXIFU_RFIF21_LENGTH                    equ 0001h
C1RXIFU_RFIF21_MASK                      equ 0020h
C1RXIFU_RFIF22_POSN                      equ 0006h
C1RXIFU_RFIF22_POSITION                  equ 0006h
C1RXIFU_RFIF22_SIZE                      equ 0001h
C1RXIFU_RFIF22_LENGTH                    equ 0001h
C1RXIFU_RFIF22_MASK                      equ 0040h
C1RXIFU_RFIF23_POSN                      equ 0007h
C1RXIFU_RFIF23_POSITION                  equ 0007h
C1RXIFU_RFIF23_SIZE                      equ 0001h
C1RXIFU_RFIF23_LENGTH                    equ 0001h
C1RXIFU_RFIF23_MASK                      equ 0080h

// Register: C1RXIFT
#define C1RXIFT C1RXIFT
C1RXIFT                                  equ 0123h
// bitfield definitions
C1RXIFT_RFIF_POSN                        equ 0000h
C1RXIFT_RFIF_POSITION                    equ 0000h
C1RXIFT_RFIF_SIZE                        equ 0008h
C1RXIFT_RFIF_LENGTH                      equ 0008h
C1RXIFT_RFIF_MASK                        equ 00FFh
C1RXIFT_RFIF24_POSN                      equ 0000h
C1RXIFT_RFIF24_POSITION                  equ 0000h
C1RXIFT_RFIF24_SIZE                      equ 0001h
C1RXIFT_RFIF24_LENGTH                    equ 0001h
C1RXIFT_RFIF24_MASK                      equ 0001h
C1RXIFT_RFIF25_POSN                      equ 0001h
C1RXIFT_RFIF25_POSITION                  equ 0001h
C1RXIFT_RFIF25_SIZE                      equ 0001h
C1RXIFT_RFIF25_LENGTH                    equ 0001h
C1RXIFT_RFIF25_MASK                      equ 0002h
C1RXIFT_RFIF26_POSN                      equ 0002h
C1RXIFT_RFIF26_POSITION                  equ 0002h
C1RXIFT_RFIF26_SIZE                      equ 0001h
C1RXIFT_RFIF26_LENGTH                    equ 0001h
C1RXIFT_RFIF26_MASK                      equ 0004h
C1RXIFT_RFIF27_POSN                      equ 0003h
C1RXIFT_RFIF27_POSITION                  equ 0003h
C1RXIFT_RFIF27_SIZE                      equ 0001h
C1RXIFT_RFIF27_LENGTH                    equ 0001h
C1RXIFT_RFIF27_MASK                      equ 0008h
C1RXIFT_RFIF28_POSN                      equ 0004h
C1RXIFT_RFIF28_POSITION                  equ 0004h
C1RXIFT_RFIF28_SIZE                      equ 0001h
C1RXIFT_RFIF28_LENGTH                    equ 0001h
C1RXIFT_RFIF28_MASK                      equ 0010h
C1RXIFT_RFIF29_POSN                      equ 0005h
C1RXIFT_RFIF29_POSITION                  equ 0005h
C1RXIFT_RFIF29_SIZE                      equ 0001h
C1RXIFT_RFIF29_LENGTH                    equ 0001h
C1RXIFT_RFIF29_MASK                      equ 0020h
C1RXIFT_RFIF30_POSN                      equ 0006h
C1RXIFT_RFIF30_POSITION                  equ 0006h
C1RXIFT_RFIF30_SIZE                      equ 0001h
C1RXIFT_RFIF30_LENGTH                    equ 0001h
C1RXIFT_RFIF30_MASK                      equ 0040h
C1RXIFT_RFIF31_POSN                      equ 0007h
C1RXIFT_RFIF31_POSITION                  equ 0007h
C1RXIFT_RFIF31_SIZE                      equ 0001h
C1RXIFT_RFIF31_LENGTH                    equ 0001h
C1RXIFT_RFIF31_MASK                      equ 0080h

