GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: C1TRECT
#define C1TRECT C1TRECT
C1TRECT                                  equ 0137h

// Register: C1BDIAG0L
#define C1BDIAG0L C1BDIAG0L
C1BDIAG0L                                equ 0138h
// bitfield definitions
C1BDIAG0L_NRERRCNT_POSN                  equ 0000h
C1BDIAG0L_NRERRCNT_POSITION              equ 0000h
C1BDIAG0L_NRERRCNT_SIZE                  equ 0008h
C1BDIAG0L_NRERRCNT_LENGTH                equ 0008h
C1BDIAG0L_NRERRCNT_MASK                  equ 00FFh
C1BDIAG0L_NRERRCNT0_POSN                 equ 0000h
C1BDIAG0L_NRERRCNT0_POSITION             equ 0000h
C1BDIAG0L_NRERRCNT0_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT0_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT0_MASK                 equ 0001h
C1BDIAG0L_NRERRCNT1_POSN                 equ 0001h
C1BDIAG0L_NRERRCNT1_POSITION             equ 0001h
C1BDIAG0L_NRERRCNT1_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT1_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT1_MASK                 equ 0002h
C1BDIAG0L_NRERRCNT2_POSN                 equ 0002h
C1BDIAG0L_NRERRCNT2_POSITION             equ 0002h
C1BDIAG0L_NRERRCNT2_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT2_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT2_MASK                 equ 0004h
C1BDIAG0L_NRERRCNT3_POSN                 equ 0003h
C1BDIAG0L_NRERRCNT3_POSITION             equ 0003h
C1BDIAG0L_NRERRCNT3_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT3_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT3_MASK                 equ 0008h
C1BDIAG0L_NRERRCNT4_POSN                 equ 0004h
C1BDIAG0L_NRERRCNT4_POSITION             equ 0004h
C1BDIAG0L_NRERRCNT4_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT4_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT4_MASK                 equ 0010h
C1BDIAG0L_NRERRCNT5_POSN                 equ 0005h
C1BDIAG0L_NRERRCNT5_POSITION             equ 0005h
C1BDIAG0L_NRERRCNT5_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT5_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT5_MASK                 equ 0020h
C1BDIAG0L_NRERRCNT6_POSN                 equ 0006h
C1BDIAG0L_NRERRCNT6_POSITION             equ 0006h
C1BDIAG0L_NRERRCNT6_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT6_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT6_MASK                 equ 0040h
C1BDIAG0L_NRERRCNT7_POSN                 equ 0007h
C1BDIAG0L_NRERRCNT7_POSITION             equ 0007h
C1BDIAG0L_NRERRCNT7_SIZE                 equ 0001h
C1BDIAG0L_NRERRCNT7_LENGTH               equ 0001h
C1BDIAG0L_NRERRCNT7_MASK                 equ 0080h

// Register: C1BDIAG0H
#define C1BDIAG0H C1BDIAG0H
C1BDIAG0H                                equ 0139h
// bitfield definitions
C1BDIAG0H_NTERRCNT_POSN                  equ 0000h
C1BDIAG0H_NTERRCNT_POSITION              equ 0000h
C1BDIAG0H_NTERRCNT_SIZE                  equ 0008h
C1BDIAG0H_NTERRCNT_LENGTH                equ 0008h
C1BDIAG0H_NTERRCNT_MASK                  equ 00FFh
C1BDIAG0H_NTERRCNT0_POSN                 equ 0000h
C1BDIAG0H_NTERRCNT0_POSITION             equ 0000h
C1BDIAG0H_NTERRCNT0_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT0_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT0_MASK                 equ 0001h
C1BDIAG0H_NTERRCNT1_POSN                 equ 0001h
C1BDIAG0H_NTERRCNT1_POSITION             equ 0001h
C1BDIAG0H_NTERRCNT1_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT1_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT1_MASK                 equ 0002h
C1BDIAG0H_NTERRCNT2_POSN                 equ 0002h
C1BDIAG0H_NTERRCNT2_POSITION             equ 0002h
C1BDIAG0H_NTERRCNT2_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT2_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT2_MASK                 equ 0004h
C1BDIAG0H_NTERRCNT3_POSN                 equ 0003h
C1BDIAG0H_NTERRCNT3_POSITION             equ 0003h
C1BDIAG0H_NTERRCNT3_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT3_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT3_MASK                 equ 0008h
C1BDIAG0H_NTERRCNT4_POSN                 equ 0004h
C1BDIAG0H_NTERRCNT4_POSITION             equ 0004h
C1BDIAG0H_NTERRCNT4_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT4_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT4_MASK                 equ 0010h
C1BDIAG0H_NTERRCNT5_POSN                 equ 0005h
C1BDIAG0H_NTERRCNT5_POSITION             equ 0005h
C1BDIAG0H_NTERRCNT5_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT5_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT5_MASK                 equ 0020h
C1BDIAG0H_NTERRCNT6_POSN                 equ 0006h
C1BDIAG0H_NTERRCNT6_POSITION             equ 0006h
C1BDIAG0H_NTERRCNT6_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT6_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT6_MASK                 equ 0040h
C1BDIAG0H_NTERRCNT7_POSN                 equ 0007h
C1BDIAG0H_NTERRCNT7_POSITION             equ 0007h
C1BDIAG0H_NTERRCNT7_SIZE                 equ 0001h
C1BDIAG0H_NTERRCNT7_LENGTH               equ 0001h
C1BDIAG0H_NTERRCNT7_MASK                 equ 0080h

// Register: C1BDIAG1L
#define C1BDIAG1L C1BDIAG1L
C1BDIAG1L                                equ 013Ch
// bitfield definitions
C1BDIAG1L_EFMSGCNT_POSN                  equ 0000h
C1BDIAG1L_EFMSGCNT_POSITION              equ 0000h
C1BDIAG1L_EFMSGCNT_SIZE                  equ 0008h
C1BDIAG1L_EFMSGCNT_LENGTH                equ 0008h
C1BDIAG1L_EFMSGCNT_MASK                  equ 00FFh
C1BDIAG1L_EFMSGCNT0_POSN                 equ 0000h
C1BDIAG1L_EFMSGCNT0_POSITION             equ 0000h
C1BDIAG1L_EFMSGCNT0_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT0_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT0_MASK                 equ 0001h
C1BDIAG1L_EFMSGCNT1_POSN                 equ 0001h
C1BDIAG1L_EFMSGCNT1_POSITION             equ 0001h
C1BDIAG1L_EFMSGCNT1_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT1_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT1_MASK                 equ 0002h
C1BDIAG1L_EFMSGCNT2_POSN                 equ 0002h
C1BDIAG1L_EFMSGCNT2_POSITION             equ 0002h
C1BDIAG1L_EFMSGCNT2_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT2_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT2_MASK                 equ 0004h
C1BDIAG1L_EFMSGCNT3_POSN                 equ 0003h
C1BDIAG1L_EFMSGCNT3_POSITION             equ 0003h
C1BDIAG1L_EFMSGCNT3_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT3_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT3_MASK                 equ 0008h
C1BDIAG1L_EFMSGCNT4_POSN                 equ 0004h
C1BDIAG1L_EFMSGCNT4_POSITION             equ 0004h
C1BDIAG1L_EFMSGCNT4_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT4_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT4_MASK                 equ 0010h
C1BDIAG1L_EFMSGCNT5_POSN                 equ 0005h
C1BDIAG1L_EFMSGCNT5_POSITION             equ 0005h
C1BDIAG1L_EFMSGCNT5_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT5_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT5_MASK                 equ 0020h
C1BDIAG1L_EFMSGCNT6_POSN                 equ 0006h
C1BDIAG1L_EFMSGCNT6_POSITION             equ 0006h
C1BDIAG1L_EFMSGCNT6_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT6_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT6_MASK                 equ 0040h
C1BDIAG1L_EFMSGCNT7_POSN                 equ 0007h
C1BDIAG1L_EFMSGCNT7_POSITION             equ 0007h
C1BDIAG1L_EFMSGCNT7_SIZE                 equ 0001h
C1BDIAG1L_EFMSGCNT7_LENGTH               equ 0001h
C1BDIAG1L_EFMSGCNT7_MASK                 equ 0080h

// Register: C1BDIAG1H
#define C1BDIAG1H C1BDIAG1H
C1BDIAG1H                                equ 013Dh
// bitfield definitions
C1BDIAG1H_EFMSGCNT_POSN                  equ 0000h
C1BDIAG1H_EFMSGCNT_POSITION              equ 0000h
C1BDIAG1H_EFMSGCNT_SIZE                  equ 0008h
C1BDIAG1H_EFMSGCNT_LENGTH                equ 0008h
C1BDIAG1H_EFMSGCNT_MASK                  equ 00FFh
C1BDIAG1H_EFMSGCNT8_POSN                 equ 0000h
C1BDIAG1H_EFMSGCNT8_POSITION             equ 0000h
C1BDIAG1H_EFMSGCNT8_SIZE                 equ 0001h
C1BDIAG1H_EFMSGCNT8_LENGTH               equ 0001h
C1BDIAG1H_EFMSGCNT8_MASK                 equ 0001h
C1BDIAG1H_EFMSGCNT9_POSN                 equ 0001h
C1BDIAG1H_EFMSGCNT9_POSITION             equ 0001h
C1BDIAG1H_EFMSGCNT9_SIZE                 equ 0001h
C1BDIAG1H_EFMSGCNT9_LENGTH               equ 0001h
C1BDIAG1H_EFMSGCNT9_MASK                 equ 0002h
C1BDIAG1H_EFMSGCNT10_POSN                equ 0002h
C1BDIAG1H_EFMSGCNT10_POSITION            equ 0002h
C1BDIAG1H_EFMSGCNT10_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT10_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT10_MASK                equ 0004h
C1BDIAG1H_EFMSGCNT11_POSN                equ 0003h
C1BDIAG1H_EFMSGCNT11_POSITION            equ 0003h
C1BDIAG1H_EFMSGCNT11_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT11_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT11_MASK                equ 0008h
C1BDIAG1H_EFMSGCNT12_POSN                equ 0004h
C1BDIAG1H_EFMSGCNT12_POSITION            equ 0004h
C1BDIAG1H_EFMSGCNT12_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT12_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT12_MASK                equ 0010h
C1BDIAG1H_EFMSGCNT13_POSN                equ 0005h
C1BDIAG1H_EFMSGCNT13_POSITION            equ 0005h
C1BDIAG1H_EFMSGCNT13_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT13_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT13_MASK                equ 0020h
C1BDIAG1H_EFMSGCNT14_POSN                equ 0006h
C1BDIAG1H_EFMSGCNT14_POSITION            equ 0006h
C1BDIAG1H_EFMSGCNT14_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT14_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT14_MASK                equ 0040h
C1BDIAG1H_EFMSGCNT15_POSN                equ 0007h
C1BDIAG1H_EFMSGCNT15_POSITION            equ 0007h
C1BDIAG1H_EFMSGCNT15_SIZE                equ 0001h
C1BDIAG1H_EFMSGCNT15_LENGTH              equ 0001h
C1BDIAG1H_EFMSGCNT15_MASK                equ 0080h

