GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: C1FIFOSTA2T
#define C1FIFOSTA2T C1FIFOSTA2T
C1FIFOSTA2T                              equ 016Fh

// Register: C1FIFOUA2
#define C1FIFOUA2 C1FIFOUA2
C1FIFOUA2                                equ 0170h

// Register: C1FIFOUA2L
#define C1FIFOUA2L C1FIFOUA2L
C1FIFOUA2L                               equ 0170h
// bitfield definitions
C1FIFOUA2L_FIFOUA_POSN                   equ 0000h
C1FIFOUA2L_FIFOUA_POSITION               equ 0000h
C1FIFOUA2L_FIFOUA_SIZE                   equ 0008h
C1FIFOUA2L_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA2L_FIFOUA_MASK                   equ 00FFh
C1FIFOUA2L_FIFOUA0_POSN                  equ 0000h
C1FIFOUA2L_FIFOUA0_POSITION              equ 0000h
C1FIFOUA2L_FIFOUA0_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA0_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA0_MASK                  equ 0001h
C1FIFOUA2L_FIFOUA1_POSN                  equ 0001h
C1FIFOUA2L_FIFOUA1_POSITION              equ 0001h
C1FIFOUA2L_FIFOUA1_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA1_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA1_MASK                  equ 0002h
C1FIFOUA2L_FIFOUA2_POSN                  equ 0002h
C1FIFOUA2L_FIFOUA2_POSITION              equ 0002h
C1FIFOUA2L_FIFOUA2_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA2_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA2_MASK                  equ 0004h
C1FIFOUA2L_FIFOUA3_POSN                  equ 0003h
C1FIFOUA2L_FIFOUA3_POSITION              equ 0003h
C1FIFOUA2L_FIFOUA3_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA3_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA3_MASK                  equ 0008h
C1FIFOUA2L_FIFOUA4_POSN                  equ 0004h
C1FIFOUA2L_FIFOUA4_POSITION              equ 0004h
C1FIFOUA2L_FIFOUA4_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA4_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA4_MASK                  equ 0010h
C1FIFOUA2L_FIFOUA5_POSN                  equ 0005h
C1FIFOUA2L_FIFOUA5_POSITION              equ 0005h
C1FIFOUA2L_FIFOUA5_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA5_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA5_MASK                  equ 0020h
C1FIFOUA2L_FIFOUA6_POSN                  equ 0006h
C1FIFOUA2L_FIFOUA6_POSITION              equ 0006h
C1FIFOUA2L_FIFOUA6_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA6_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA6_MASK                  equ 0040h
C1FIFOUA2L_FIFOUA7_POSN                  equ 0007h
C1FIFOUA2L_FIFOUA7_POSITION              equ 0007h
C1FIFOUA2L_FIFOUA7_SIZE                  equ 0001h
C1FIFOUA2L_FIFOUA7_LENGTH                equ 0001h
C1FIFOUA2L_FIFOUA7_MASK                  equ 0080h

// Register: C1FIFOUA2H
#define C1FIFOUA2H C1FIFOUA2H
C1FIFOUA2H                               equ 0171h
// bitfield definitions
C1FIFOUA2H_FIFOUA_POSN                   equ 0000h
C1FIFOUA2H_FIFOUA_POSITION               equ 0000h
C1FIFOUA2H_FIFOUA_SIZE                   equ 0008h
C1FIFOUA2H_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA2H_FIFOUA_MASK                   equ 00FFh
C1FIFOUA2H_FIFOUA8_POSN                  equ 0000h
C1FIFOUA2H_FIFOUA8_POSITION              equ 0000h
C1FIFOUA2H_FIFOUA8_SIZE                  equ 0001h
C1FIFOUA2H_FIFOUA8_LENGTH                equ 0001h
C1FIFOUA2H_FIFOUA8_MASK                  equ 0001h
C1FIFOUA2H_FIFOUA9_POSN                  equ 0001h
C1FIFOUA2H_FIFOUA9_POSITION              equ 0001h
C1FIFOUA2H_FIFOUA9_SIZE                  equ 0001h
C1FIFOUA2H_FIFOUA9_LENGTH                equ 0001h
C1FIFOUA2H_FIFOUA9_MASK                  equ 0002h
C1FIFOUA2H_FIFOUA10_POSN                 equ 0002h
C1FIFOUA2H_FIFOUA10_POSITION             equ 0002h
C1FIFOUA2H_FIFOUA10_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA10_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA10_MASK                 equ 0004h
C1FIFOUA2H_FIFOUA11_POSN                 equ 0003h
C1FIFOUA2H_FIFOUA11_POSITION             equ 0003h
C1FIFOUA2H_FIFOUA11_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA11_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA11_MASK                 equ 0008h
C1FIFOUA2H_FIFOUA12_POSN                 equ 0004h
C1FIFOUA2H_FIFOUA12_POSITION             equ 0004h
C1FIFOUA2H_FIFOUA12_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA12_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA12_MASK                 equ 0010h
C1FIFOUA2H_FIFOUA13_POSN                 equ 0005h
C1FIFOUA2H_FIFOUA13_POSITION             equ 0005h
C1FIFOUA2H_FIFOUA13_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA13_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA13_MASK                 equ 0020h
C1FIFOUA2H_FIFOUA14_POSN                 equ 0006h
C1FIFOUA2H_FIFOUA14_POSITION             equ 0006h
C1FIFOUA2H_FIFOUA14_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA14_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA14_MASK                 equ 0040h
C1FIFOUA2H_FIFOUA15_POSN                 equ 0007h
C1FIFOUA2H_FIFOUA15_POSITION             equ 0007h
C1FIFOUA2H_FIFOUA15_SIZE                 equ 0001h
C1FIFOUA2H_FIFOUA15_LENGTH               equ 0001h
C1FIFOUA2H_FIFOUA15_MASK                 equ 0080h

// Register: C1FIFOUA2U
#define C1FIFOUA2U C1FIFOUA2U
C1FIFOUA2U                               equ 0172h
// bitfield definitions
C1FIFOUA2U_FIFOUA_POSN                   equ 0000h
C1FIFOUA2U_FIFOUA_POSITION               equ 0000h
C1FIFOUA2U_FIFOUA_SIZE                   equ 0008h
C1FIFOUA2U_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA2U_FIFOUA_MASK                   equ 00FFh
C1FIFOUA2U_FIFOUA16_POSN                 equ 0000h
C1FIFOUA2U_FIFOUA16_POSITION             equ 0000h
C1FIFOUA2U_FIFOUA16_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA16_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA16_MASK                 equ 0001h
C1FIFOUA2U_FIFOUA17_POSN                 equ 0001h
C1FIFOUA2U_FIFOUA17_POSITION             equ 0001h
C1FIFOUA2U_FIFOUA17_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA17_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA17_MASK                 equ 0002h
C1FIFOUA2U_FIFOUA18_POSN                 equ 0002h
C1FIFOUA2U_FIFOUA18_POSITION             equ 0002h
C1FIFOUA2U_FIFOUA18_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA18_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA18_MASK                 equ 0004h
C1FIFOUA2U_FIFOUA19_POSN                 equ 0003h
C1FIFOUA2U_FIFOUA19_POSITION             equ 0003h
C1FIFOUA2U_FIFOUA19_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA19_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA19_MASK                 equ 0008h
C1FIFOUA2U_FIFOUA20_POSN                 equ 0004h
C1FIFOUA2U_FIFOUA20_POSITION             equ 0004h
C1FIFOUA2U_FIFOUA20_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA20_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA20_MASK                 equ 0010h
C1FIFOUA2U_FIFOUA21_POSN                 equ 0005h
C1FIFOUA2U_FIFOUA21_POSITION             equ 0005h
C1FIFOUA2U_FIFOUA21_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA21_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA21_MASK                 equ 0020h
C1FIFOUA2U_FIFOUA22_POSN                 equ 0006h
C1FIFOUA2U_FIFOUA22_POSITION             equ 0006h
C1FIFOUA2U_FIFOUA22_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA22_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA22_MASK                 equ 0040h
C1FIFOUA2U_FIFOUA23_POSN                 equ 0007h
C1FIFOUA2U_FIFOUA23_POSITION             equ 0007h
C1FIFOUA2U_FIFOUA23_SIZE                 equ 0001h
C1FIFOUA2U_FIFOUA23_LENGTH               equ 0001h
C1FIFOUA2U_FIFOUA23_MASK                 equ 0080h

