GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: C1MASK4
#define C1MASK4 C1MASK4
C1MASK4                                  equ 01B0h

// Register: C1MASK4L
#define C1MASK4L C1MASK4L
C1MASK4L                                 equ 01B0h
// bitfield definitions
C1MASK4L_MSID_POSN                       equ 0000h
C1MASK4L_MSID_POSITION                   equ 0000h
C1MASK4L_MSID_SIZE                       equ 0008h
C1MASK4L_MSID_LENGTH                     equ 0008h
C1MASK4L_MSID_MASK                       equ 00FFh
C1MASK4L_MSID0_POSN                      equ 0000h
C1MASK4L_MSID0_POSITION                  equ 0000h
C1MASK4L_MSID0_SIZE                      equ 0001h
C1MASK4L_MSID0_LENGTH                    equ 0001h
C1MASK4L_MSID0_MASK                      equ 0001h
C1MASK4L_MSID1_POSN                      equ 0001h
C1MASK4L_MSID1_POSITION                  equ 0001h
C1MASK4L_MSID1_SIZE                      equ 0001h
C1MASK4L_MSID1_LENGTH                    equ 0001h
C1MASK4L_MSID1_MASK                      equ 0002h
C1MASK4L_MSID2_POSN                      equ 0002h
C1MASK4L_MSID2_POSITION                  equ 0002h
C1MASK4L_MSID2_SIZE                      equ 0001h
C1MASK4L_MSID2_LENGTH                    equ 0001h
C1MASK4L_MSID2_MASK                      equ 0004h
C1MASK4L_MSID3_POSN                      equ 0003h
C1MASK4L_MSID3_POSITION                  equ 0003h
C1MASK4L_MSID3_SIZE                      equ 0001h
C1MASK4L_MSID3_LENGTH                    equ 0001h
C1MASK4L_MSID3_MASK                      equ 0008h
C1MASK4L_MSID4_POSN                      equ 0004h
C1MASK4L_MSID4_POSITION                  equ 0004h
C1MASK4L_MSID4_SIZE                      equ 0001h
C1MASK4L_MSID4_LENGTH                    equ 0001h
C1MASK4L_MSID4_MASK                      equ 0010h
C1MASK4L_MSID5_POSN                      equ 0005h
C1MASK4L_MSID5_POSITION                  equ 0005h
C1MASK4L_MSID5_SIZE                      equ 0001h
C1MASK4L_MSID5_LENGTH                    equ 0001h
C1MASK4L_MSID5_MASK                      equ 0020h
C1MASK4L_MSID6_POSN                      equ 0006h
C1MASK4L_MSID6_POSITION                  equ 0006h
C1MASK4L_MSID6_SIZE                      equ 0001h
C1MASK4L_MSID6_LENGTH                    equ 0001h
C1MASK4L_MSID6_MASK                      equ 0040h
C1MASK4L_MSID7_POSN                      equ 0007h
C1MASK4L_MSID7_POSITION                  equ 0007h
C1MASK4L_MSID7_SIZE                      equ 0001h
C1MASK4L_MSID7_LENGTH                    equ 0001h
C1MASK4L_MSID7_MASK                      equ 0080h

// Register: C1MASK4H
#define C1MASK4H C1MASK4H
C1MASK4H                                 equ 01B1h
// bitfield definitions
C1MASK4H_MSID_POSN                       equ 0000h
C1MASK4H_MSID_POSITION                   equ 0000h
C1MASK4H_MSID_SIZE                       equ 0003h
C1MASK4H_MSID_LENGTH                     equ 0003h
C1MASK4H_MSID_MASK                       equ 0007h
C1MASK4H_MEID_POSN                       equ 0003h
C1MASK4H_MEID_POSITION                   equ 0003h
C1MASK4H_MEID_SIZE                       equ 0005h
C1MASK4H_MEID_LENGTH                     equ 0005h
C1MASK4H_MEID_MASK                       equ 00F8h
C1MASK4H_MSID8_POSN                      equ 0000h
C1MASK4H_MSID8_POSITION                  equ 0000h
C1MASK4H_MSID8_SIZE                      equ 0001h
C1MASK4H_MSID8_LENGTH                    equ 0001h
C1MASK4H_MSID8_MASK                      equ 0001h
C1MASK4H_MSID9_POSN                      equ 0001h
C1MASK4H_MSID9_POSITION                  equ 0001h
C1MASK4H_MSID9_SIZE                      equ 0001h
C1MASK4H_MSID9_LENGTH                    equ 0001h
C1MASK4H_MSID9_MASK                      equ 0002h
C1MASK4H_MSID10_POSN                     equ 0002h
C1MASK4H_MSID10_POSITION                 equ 0002h
C1MASK4H_MSID10_SIZE                     equ 0001h
C1MASK4H_MSID10_LENGTH                   equ 0001h
C1MASK4H_MSID10_MASK                     equ 0004h
C1MASK4H_MEID0_POSN                      equ 0003h
C1MASK4H_MEID0_POSITION                  equ 0003h
C1MASK4H_MEID0_SIZE                      equ 0001h
C1MASK4H_MEID0_LENGTH                    equ 0001h
C1MASK4H_MEID0_MASK                      equ 0008h
C1MASK4H_MEID1_POSN                      equ 0004h
C1MASK4H_MEID1_POSITION                  equ 0004h
C1MASK4H_MEID1_SIZE                      equ 0001h
C1MASK4H_MEID1_LENGTH                    equ 0001h
C1MASK4H_MEID1_MASK                      equ 0010h
C1MASK4H_MEID2_POSN                      equ 0005h
C1MASK4H_MEID2_POSITION                  equ 0005h
C1MASK4H_MEID2_SIZE                      equ 0001h
C1MASK4H_MEID2_LENGTH                    equ 0001h
C1MASK4H_MEID2_MASK                      equ 0020h
C1MASK4H_MEID3_POSN                      equ 0006h
C1MASK4H_MEID3_POSITION                  equ 0006h
C1MASK4H_MEID3_SIZE                      equ 0001h
C1MASK4H_MEID3_LENGTH                    equ 0001h
C1MASK4H_MEID3_MASK                      equ 0040h
C1MASK4H_MEID4_POSN                      equ 0007h
C1MASK4H_MEID4_POSITION                  equ 0007h
C1MASK4H_MEID4_SIZE                      equ 0001h
C1MASK4H_MEID4_LENGTH                    equ 0001h
C1MASK4H_MEID4_MASK                      equ 0080h

// Register: C1MASK4U
#define C1MASK4U C1MASK4U
C1MASK4U                                 equ 01B2h
// bitfield definitions
C1MASK4U_MEID_POSN                       equ 0000h
C1MASK4U_MEID_POSITION                   equ 0000h
C1MASK4U_MEID_SIZE                       equ 0008h
C1MASK4U_MEID_LENGTH                     equ 0008h
C1MASK4U_MEID_MASK                       equ 00FFh
C1MASK4U_MEID5_POSN                      equ 0000h
C1MASK4U_MEID5_POSITION                  equ 0000h
C1MASK4U_MEID5_SIZE                      equ 0001h
C1MASK4U_MEID5_LENGTH                    equ 0001h
C1MASK4U_MEID5_MASK                      equ 0001h
C1MASK4U_MEID6_POSN                      equ 0001h
C1MASK4U_MEID6_POSITION                  equ 0001h
C1MASK4U_MEID6_SIZE                      equ 0001h
C1MASK4U_MEID6_LENGTH                    equ 0001h
C1MASK4U_MEID6_MASK                      equ 0002h
C1MASK4U_MEID7_POSN                      equ 0002h
C1MASK4U_MEID7_POSITION                  equ 0002h
C1MASK4U_MEID7_SIZE                      equ 0001h
C1MASK4U_MEID7_LENGTH                    equ 0001h
C1MASK4U_MEID7_MASK                      equ 0004h
C1MASK4U_MEID8_POSN                      equ 0003h
C1MASK4U_MEID8_POSITION                  equ 0003h
C1MASK4U_MEID8_SIZE                      equ 0001h
C1MASK4U_MEID8_LENGTH                    equ 0001h
C1MASK4U_MEID8_MASK                      equ 0008h
C1MASK4U_MEID9_POSN                      equ 0004h
C1MASK4U_MEID9_POSITION                  equ 0004h
C1MASK4U_MEID9_SIZE                      equ 0001h
C1MASK4U_MEID9_LENGTH                    equ 0001h
C1MASK4U_MEID9_MASK                      equ 0010h
C1MASK4U_MEID10_POSN                     equ 0005h
C1MASK4U_MEID10_POSITION                 equ 0005h
C1MASK4U_MEID10_SIZE                     equ 0001h
C1MASK4U_MEID10_LENGTH                   equ 0001h
C1MASK4U_MEID10_MASK                     equ 0020h
C1MASK4U_MEID11_POSN                     equ 0006h
C1MASK4U_MEID11_POSITION                 equ 0006h
C1MASK4U_MEID11_SIZE                     equ 0001h
C1MASK4U_MEID11_LENGTH                   equ 0001h
C1MASK4U_MEID11_MASK                     equ 0040h
C1MASK4U_MEID12_POSN                     equ 0007h
C1MASK4U_MEID12_POSITION                 equ 0007h
C1MASK4U_MEID12_SIZE                     equ 0001h
C1MASK4U_MEID12_LENGTH                   equ 0001h
C1MASK4U_MEID12_MASK                     equ 0080h

