GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: ADCSEL1
#define ADCSEL1 ADCSEL1
ADCSEL1                                  equ 03FCh
// bitfield definitions
ADCSEL1_SSI_POSN                         equ 0006h
ADCSEL1_SSI_POSITION                     equ 0006h
ADCSEL1_SSI_SIZE                         equ 0001h
ADCSEL1_SSI_LENGTH                       equ 0001h
ADCSEL1_SSI_MASK                         equ 0040h
ADCSEL1_CHEN_POSN                        equ 0007h
ADCSEL1_CHEN_POSITION                    equ 0007h
ADCSEL1_CHEN_SIZE                        equ 0001h
ADCSEL1_CHEN_LENGTH                      equ 0001h
ADCSEL1_CHEN_MASK                        equ 0080h

// Register: ADCSEL2
#define ADCSEL2 ADCSEL2
ADCSEL2                                  equ 03FDh
// bitfield definitions
ADCSEL2_SSI_POSN                         equ 0006h
ADCSEL2_SSI_POSITION                     equ 0006h
ADCSEL2_SSI_SIZE                         equ 0001h
ADCSEL2_SSI_LENGTH                       equ 0001h
ADCSEL2_SSI_MASK                         equ 0040h
ADCSEL2_CHEN_POSN                        equ 0007h
ADCSEL2_CHEN_POSITION                    equ 0007h
ADCSEL2_CHEN_SIZE                        equ 0001h
ADCSEL2_CHEN_LENGTH                      equ 0001h
ADCSEL2_CHEN_MASK                        equ 0080h

// Register: ADCSEL3
#define ADCSEL3 ADCSEL3
ADCSEL3                                  equ 03FEh
// bitfield definitions
ADCSEL3_SSI_POSN                         equ 0006h
ADCSEL3_SSI_POSITION                     equ 0006h
ADCSEL3_SSI_SIZE                         equ 0001h
ADCSEL3_SSI_LENGTH                       equ 0001h
ADCSEL3_SSI_MASK                         equ 0040h
ADCSEL3_CHEN_POSN                        equ 0007h
ADCSEL3_CHEN_POSITION                    equ 0007h
ADCSEL3_CHEN_SIZE                        equ 0001h
ADCSEL3_CHEN_LENGTH                      equ 0001h
ADCSEL3_CHEN_MASK                        equ 0080h

// Register: ADCSEL4
#define ADCSEL4 ADCSEL4
ADCSEL4                                  equ 03FFh
// bitfield definitions
ADCSEL4_SSI_POSN                         equ 0006h
ADCSEL4_SSI_POSITION                     equ 0006h
ADCSEL4_SSI_SIZE                         equ 0001h
ADCSEL4_SSI_LENGTH                       equ 0001h
ADCSEL4_SSI_MASK                         equ 0040h
ADCSEL4_CHEN_POSN                        equ 0007h
ADCSEL4_CHEN_POSITION                    equ 0007h
ADCSEL4_CHEN_SIZE                        equ 0001h
ADCSEL4_CHEN_LENGTH                      equ 0001h
ADCSEL4_CHEN_MASK                        equ 0080h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 0400h
// bitfield definitions
ANSELA_ANSELA0_POSN                      equ 0000h
ANSELA_ANSELA0_POSITION                  equ 0000h
ANSELA_ANSELA0_SIZE                      equ 0001h
ANSELA_ANSELA0_LENGTH                    equ 0001h
ANSELA_ANSELA0_MASK                      equ 0001h
ANSELA_ANSELA1_POSN                      equ 0001h
ANSELA_ANSELA1_POSITION                  equ 0001h
ANSELA_ANSELA1_SIZE                      equ 0001h
ANSELA_ANSELA1_LENGTH                    equ 0001h
ANSELA_ANSELA1_MASK                      equ 0002h
ANSELA_ANSELA2_POSN                      equ 0002h
ANSELA_ANSELA2_POSITION                  equ 0002h
ANSELA_ANSELA2_SIZE                      equ 0001h
ANSELA_ANSELA2_LENGTH                    equ 0001h
ANSELA_ANSELA2_MASK                      equ 0004h
ANSELA_ANSELA3_POSN                      equ 0003h
ANSELA_ANSELA3_POSITION                  equ 0003h
ANSELA_ANSELA3_SIZE                      equ 0001h
ANSELA_ANSELA3_LENGTH                    equ 0001h
ANSELA_ANSELA3_MASK                      equ 0008h
ANSELA_ANSELA4_POSN                      equ 0004h
ANSELA_ANSELA4_POSITION                  equ 0004h
ANSELA_ANSELA4_SIZE                      equ 0001h
ANSELA_ANSELA4_LENGTH                    equ 0001h
ANSELA_ANSELA4_MASK                      equ 0010h
ANSELA_ANSELA5_POSN                      equ 0005h
ANSELA_ANSELA5_POSITION                  equ 0005h
ANSELA_ANSELA5_SIZE                      equ 0001h
ANSELA_ANSELA5_LENGTH                    equ 0001h
ANSELA_ANSELA5_MASK                      equ 0020h
ANSELA_ANSELA6_POSN                      equ 0006h
ANSELA_ANSELA6_POSITION                  equ 0006h
ANSELA_ANSELA6_SIZE                      equ 0001h
ANSELA_ANSELA6_LENGTH                    equ 0001h
ANSELA_ANSELA6_MASK                      equ 0040h
ANSELA_ANSELA7_POSN                      equ 0007h
ANSELA_ANSELA7_POSITION                  equ 0007h
ANSELA_ANSELA7_SIZE                      equ 0001h
ANSELA_ANSELA7_LENGTH                    equ 0001h
ANSELA_ANSELA7_MASK                      equ 0080h

// Register: WPUA
#define WPUA WPUA
WPUA                                     equ 0401h
// bitfield definitions
WPUA_WPUA0_POSN                          equ 0000h
WPUA_WPUA0_POSITION                      equ 0000h
WPUA_WPUA0_SIZE                          equ 0001h
WPUA_WPUA0_LENGTH                        equ 0001h
WPUA_WPUA0_MASK                          equ 0001h
WPUA_WPUA1_POSN                          equ 0001h
WPUA_WPUA1_POSITION                      equ 0001h
WPUA_WPUA1_SIZE                          equ 0001h
WPUA_WPUA1_LENGTH                        equ 0001h
WPUA_WPUA1_MASK                          equ 0002h
WPUA_WPUA2_POSN                          equ 0002h
WPUA_WPUA2_POSITION                      equ 0002h
WPUA_WPUA2_SIZE                          equ 0001h
WPUA_WPUA2_LENGTH                        equ 0001h
WPUA_WPUA2_MASK                          equ 0004h
WPUA_WPUA3_POSN                          equ 0003h
WPUA_WPUA3_POSITION                      equ 0003h
WPUA_WPUA3_SIZE                          equ 0001h
WPUA_WPUA3_LENGTH                        equ 0001h
WPUA_WPUA3_MASK                          equ 0008h
WPUA_WPUA4_POSN                          equ 0004h
WPUA_WPUA4_POSITION                      equ 0004h
WPUA_WPUA4_SIZE                          equ 0001h
WPUA_WPUA4_LENGTH                        equ 0001h
WPUA_WPUA4_MASK                          equ 0010h
WPUA_WPUA5_POSN                          equ 0005h
WPUA_WPUA5_POSITION                      equ 0005h
WPUA_WPUA5_SIZE                          equ 0001h
WPUA_WPUA5_LENGTH                        equ 0001h
WPUA_WPUA5_MASK                          equ 0020h
WPUA_WPUA6_POSN                          equ 0006h
WPUA_WPUA6_POSITION                      equ 0006h
WPUA_WPUA6_SIZE                          equ 0001h
WPUA_WPUA6_LENGTH                        equ 0001h
WPUA_WPUA6_MASK                          equ 0040h
WPUA_WPUA7_POSN                          equ 0007h
WPUA_WPUA7_POSITION                      equ 0007h
WPUA_WPUA7_SIZE                          equ 0001h
WPUA_WPUA7_LENGTH                        equ 0001h
WPUA_WPUA7_MASK                          equ 0080h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 0402h
// bitfield definitions
ODCONA_ODCA0_POSN                        equ 0000h
ODCONA_ODCA0_POSITION                    equ 0000h
ODCONA_ODCA0_SIZE                        equ 0001h
ODCONA_ODCA0_LENGTH                      equ 0001h
ODCONA_ODCA0_MASK                        equ 0001h
ODCONA_ODCA1_POSN                        equ 0001h
ODCONA_ODCA1_POSITION                    equ 0001h
ODCONA_ODCA1_SIZE                        equ 0001h
ODCONA_ODCA1_LENGTH                      equ 0001h
ODCONA_ODCA1_MASK                        equ 0002h
ODCONA_ODCA2_POSN                        equ 0002h
ODCONA_ODCA2_POSITION                    equ 0002h
ODCONA_ODCA2_SIZE                        equ 0001h
ODCONA_ODCA2_LENGTH                      equ 0001h
ODCONA_ODCA2_MASK                        equ 0004h
ODCONA_ODCA3_POSN                        equ 0003h
ODCONA_ODCA3_POSITION                    equ 0003h
ODCONA_ODCA3_SIZE                        equ 0001h
ODCONA_ODCA3_LENGTH                      equ 0001h
ODCONA_ODCA3_MASK                        equ 0008h
ODCONA_ODCA4_POSN                        equ 0004h
ODCONA_ODCA4_POSITION                    equ 0004h
ODCONA_ODCA4_SIZE                        equ 0001h
ODCONA_ODCA4_LENGTH                      equ 0001h
ODCONA_ODCA4_MASK                        equ 0010h
ODCONA_ODCA5_POSN                        equ 0005h
ODCONA_ODCA5_POSITION                    equ 0005h
ODCONA_ODCA5_SIZE                        equ 0001h
ODCONA_ODCA5_LENGTH                      equ 0001h
ODCONA_ODCA5_MASK                        equ 0020h
ODCONA_ODCA6_POSN                        equ 0006h
ODCONA_ODCA6_POSITION                    equ 0006h
ODCONA_ODCA6_SIZE                        equ 0001h
ODCONA_ODCA6_LENGTH                      equ 0001h
ODCONA_ODCA6_MASK                        equ 0040h
ODCONA_ODCA7_POSN                        equ 0007h
ODCONA_ODCA7_POSITION                    equ 0007h
ODCONA_ODCA7_SIZE                        equ 0001h
ODCONA_ODCA7_LENGTH                      equ 0001h
ODCONA_ODCA7_MASK                        equ 0080h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 0403h
// bitfield definitions
SLRCONA_SLRA0_POSN                       equ 0000h
SLRCONA_SLRA0_POSITION                   equ 0000h
SLRCONA_SLRA0_SIZE                       equ 0001h
SLRCONA_SLRA0_LENGTH                     equ 0001h
SLRCONA_SLRA0_MASK                       equ 0001h
SLRCONA_SLRA1_POSN                       equ 0001h
SLRCONA_SLRA1_POSITION                   equ 0001h
SLRCONA_SLRA1_SIZE                       equ 0001h
SLRCONA_SLRA1_LENGTH                     equ 0001h
SLRCONA_SLRA1_MASK                       equ 0002h
SLRCONA_SLRA2_POSN                       equ 0002h
SLRCONA_SLRA2_POSITION                   equ 0002h
SLRCONA_SLRA2_SIZE                       equ 0001h
SLRCONA_SLRA2_LENGTH                     equ 0001h
SLRCONA_SLRA2_MASK                       equ 0004h
SLRCONA_SLRA3_POSN                       equ 0003h
SLRCONA_SLRA3_POSITION                   equ 0003h
SLRCONA_SLRA3_SIZE                       equ 0001h
SLRCONA_SLRA3_LENGTH                     equ 0001h
SLRCONA_SLRA3_MASK                       equ 0008h
SLRCONA_SLRA4_POSN                       equ 0004h
SLRCONA_SLRA4_POSITION                   equ 0004h
SLRCONA_SLRA4_SIZE                       equ 0001h
SLRCONA_SLRA4_LENGTH                     equ 0001h
SLRCONA_SLRA4_MASK                       equ 0010h
SLRCONA_SLRA5_POSN                       equ 0005h
SLRCONA_SLRA5_POSITION                   equ 0005h
SLRCONA_SLRA5_SIZE                       equ 0001h
SLRCONA_SLRA5_LENGTH                     equ 0001h
SLRCONA_SLRA5_MASK                       equ 0020h
SLRCONA_SLRA6_POSN                       equ 0006h
SLRCONA_SLRA6_POSITION                   equ 0006h
SLRCONA_SLRA6_SIZE                       equ 0001h
SLRCONA_SLRA6_LENGTH                     equ 0001h
SLRCONA_SLRA6_MASK                       equ 0040h
SLRCONA_SLRA7_POSN                       equ 0007h
SLRCONA_SLRA7_POSITION                   equ 0007h
SLRCONA_SLRA7_SIZE                       equ 0001h
SLRCONA_SLRA7_LENGTH                     equ 0001h
SLRCONA_SLRA7_MASK                       equ 0080h

