GopalSaraf/Practicals/PSDL/include/proc/pic18f46q83.inc
// Register: PIR15
#define PIR15 PIR15
PIR15                                    equ 04BDh
// bitfield definitions
PIR15_NVMIF_POSN                         equ 0000h
PIR15_NVMIF_POSITION                     equ 0000h
PIR15_NVMIF_SIZE                         equ 0001h
PIR15_NVMIF_LENGTH                       equ 0001h
PIR15_NVMIF_MASK                         equ 0001h
PIR15_CLC8IF_POSN                        equ 0001h
PIR15_CLC8IF_POSITION                    equ 0001h
PIR15_CLC8IF_SIZE                        equ 0001h
PIR15_CLC8IF_LENGTH                      equ 0001h
PIR15_CLC8IF_MASK                        equ 0002h
PIR15_CRCIF_POSN                         equ 0002h
PIR15_CRCIF_POSITION                     equ 0002h
PIR15_CRCIF_SIZE                         equ 0001h
PIR15_CRCIF_LENGTH                       equ 0001h
PIR15_CRCIF_MASK                         equ 0004h
PIR15_TMR6IF_POSN                        equ 0003h
PIR15_TMR6IF_POSITION                    equ 0003h
PIR15_TMR6IF_SIZE                        equ 0001h
PIR15_TMR6IF_LENGTH                      equ 0001h
PIR15_TMR6IF_MASK                        equ 0008h
PIR15_DMA8SCNTIF_POSN                    equ 0004h
PIR15_DMA8SCNTIF_POSITION                equ 0004h
PIR15_DMA8SCNTIF_SIZE                    equ 0001h
PIR15_DMA8SCNTIF_LENGTH                  equ 0001h
PIR15_DMA8SCNTIF_MASK                    equ 0010h
PIR15_DMA8DCNTIF_POSN                    equ 0005h
PIR15_DMA8DCNTIF_POSITION                equ 0005h
PIR15_DMA8DCNTIF_SIZE                    equ 0001h
PIR15_DMA8DCNTIF_LENGTH                  equ 0001h
PIR15_DMA8DCNTIF_MASK                    equ 0020h
PIR15_DMA8ORIF_POSN                      equ 0006h
PIR15_DMA8ORIF_POSITION                  equ 0006h
PIR15_DMA8ORIF_SIZE                      equ 0001h
PIR15_DMA8ORIF_LENGTH                    equ 0001h
PIR15_DMA8ORIF_MASK                      equ 0040h
PIR15_DMA8AIF_POSN                       equ 0007h
PIR15_DMA8AIF_POSITION                   equ 0007h
PIR15_DMA8AIF_SIZE                       equ 0001h
PIR15_DMA8AIF_LENGTH                     equ 0001h
PIR15_DMA8AIF_MASK                       equ 0080h

// Register: LATA
#define LATA LATA
LATA                                     equ 04BEh
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA3_POSN                          equ 0003h
LATA_LATA3_POSITION                      equ 0003h
LATA_LATA3_SIZE                          equ 0001h
LATA_LATA3_LENGTH                        equ 0001h
LATA_LATA3_MASK                          equ 0008h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h
LATA_LATA6_POSN                          equ 0006h
LATA_LATA6_POSITION                      equ 0006h
LATA_LATA6_SIZE                          equ 0001h
LATA_LATA6_LENGTH                        equ 0001h
LATA_LATA6_MASK                          equ 0040h
LATA_LATA7_POSN                          equ 0007h
LATA_LATA7_POSITION                      equ 0007h
LATA_LATA7_SIZE                          equ 0001h
LATA_LATA7_LENGTH                        equ 0001h
LATA_LATA7_MASK                          equ 0080h

// Register: LATB
#define LATB LATB
LATB                                     equ 04BFh
// bitfield definitions
LATB_LATB0_POSN                          equ 0000h
LATB_LATB0_POSITION                      equ 0000h
LATB_LATB0_SIZE                          equ 0001h
LATB_LATB0_LENGTH                        equ 0001h
LATB_LATB0_MASK                          equ 0001h
LATB_LATB1_POSN                          equ 0001h
LATB_LATB1_POSITION                      equ 0001h
LATB_LATB1_SIZE                          equ 0001h
LATB_LATB1_LENGTH                        equ 0001h
LATB_LATB1_MASK                          equ 0002h
LATB_LATB2_POSN                          equ 0002h
LATB_LATB2_POSITION                      equ 0002h
LATB_LATB2_SIZE                          equ 0001h
LATB_LATB2_LENGTH                        equ 0001h
LATB_LATB2_MASK                          equ 0004h
LATB_LATB3_POSN                          equ 0003h
LATB_LATB3_POSITION                      equ 0003h
LATB_LATB3_SIZE                          equ 0001h
LATB_LATB3_LENGTH                        equ 0001h
LATB_LATB3_MASK                          equ 0008h
LATB_LATB4_POSN                          equ 0004h
LATB_LATB4_POSITION                      equ 0004h
LATB_LATB4_SIZE                          equ 0001h
LATB_LATB4_LENGTH                        equ 0001h
LATB_LATB4_MASK                          equ 0010h
LATB_LATB5_POSN                          equ 0005h
LATB_LATB5_POSITION                      equ 0005h
LATB_LATB5_SIZE                          equ 0001h
LATB_LATB5_LENGTH                        equ 0001h
LATB_LATB5_MASK                          equ 0020h
LATB_LATB6_POSN                          equ 0006h
LATB_LATB6_POSITION                      equ 0006h
LATB_LATB6_SIZE                          equ 0001h
LATB_LATB6_LENGTH                        equ 0001h
LATB_LATB6_MASK                          equ 0040h
LATB_LATB7_POSN                          equ 0007h
LATB_LATB7_POSITION                      equ 0007h
LATB_LATB7_SIZE                          equ 0001h
LATB_LATB7_LENGTH                        equ 0001h
LATB_LATB7_MASK                          equ 0080h

